hankso/esp32/espbase/main/drivers.c
/* 
 * File: drivers.c
 * Authors: Hank <hankso1106@gmail.com>
 * Create: 2020-05-06 19:54:28
 */

#include "drivers.h"
#include "hidtool.h"            // for hid_report_xxx
#include "ledmode.h"            // for led_initialize
#include "avcmode.h"            // for avc_initialize
#include "sensors.h"            // for tscn_command
#include "screen.h"             // for scn_initialize && scn_command
#include "config.h"

#include "esp_attr.h"
#include "esp_intr_alloc.h"     // for GPIO_INTR_XXX
#include "soc/soc_caps.h"
#include "driver/ledc.h"
#include "freertos/FreeRTOS.h"
#include "freertos/task.h"

#ifdef CONFIG_BASE_USE_BTN
#   include "iot_button.h"
#endif

#ifdef CONFIG_BASE_USE_KNOB
#   include "iot_knob.h"
#endif

static UNUSED const char *TAG = "Driver";

/******************************************************************************
 * UART with custom pin
 */

static void uart_initialize() {
    // esp_vfs_dev_uart_register is called on startup code to use /dev/uart0
    fflush(stdout); fsync(fileno(stdout));

#ifdef CONFIG_BASE_USE_UART
    // UART driver configuration
    uart_config_t uart_conf = {
#   ifdef CONFIG_BASE_USE_CONSOLE
        .baud_rate = CONFIG_ESP_CONSOLE_UART_BAUDRATE,
#   else
        .baud_rate = 115200,
#   endif
        .data_bits = UART_DATA_8_BITS,
        .parity = UART_PARITY_DISABLE,
        .stop_bits = UART_STOP_BITS_1,
#   if SOC_UART_SUPPORT_REF_TICK
        .source_clk = UART_SCLK_REF_TICK
#   elif SOC_UART_SUPPORT_XTAL_CLK
        .source_clk = UART_SCLK_XTAL
#   else
#       error "No UART clock source is aware of DFS"
#   endif
    };
    uart_param_config(NUM_UART, &uart_conf);
    uart_set_pin(NUM_UART, PIN_TXD, PIN_RXD, PIN_RTS, PIN_CTS);
    ESP_ERROR_CHECK( uart_driver_install(NUM_UART, 256, 0, 0, NULL, 0) );
#endif
}

/******************************************************************************
 * ADC analog in
 */

#ifdef CONFIG_BASE_USE_ADC
#include "soc/adc_periph.h"

#ifdef IDF_TARGET_V5
#   include "esp_adc/adc_oneshot.h"
#   include "esp_adc/adc_cali.h"
#   include "esp_adc/adc_cali_scheme.h"
#else
#   include "driver/adc.h"
#   include "esp_adc_cal.h"
#endif

static struct {
#ifdef IDF_TARGET_V5
    adc_cali_handle_t cali;
    adc_oneshot_unit_handle_t oneshot;
#else
    esp_adc_cal_characteristics_t chars;
#endif
    adc_channel_t chans[3];
    gpio_num_t pins[3];
    uint8_t nsample;
    const adc_unit_t unit;
    const adc_atten_t atten;
    const adc_bits_width_t width;
} adc = {
#ifdef IDF_TARGET_V5
    .cali = { 0 },
    .oneshot = { 0 },
#else
    .chars = { 0 },
#endif
    .pins = {
#ifdef PIN_ADC0
        PIN_ADC0,
#else
        GPIO_NUM_NC,
#endif
#ifdef PIN_ADC1
        PIN_ADC1,
#else
        GPIO_NUM_NC,
#endif
#ifdef PIN_ADC2
        PIN_ADC2,
#else
        GPIO_NUM_NC,
#endif
    },
    .chans = { ADC_CHANNEL_MAX, ADC_CHANNEL_MAX, ADC_CHANNEL_MAX },
    .unit = ADC_UNIT_1, // only use ADC1
    .atten = ADC_ATTEN_DB_12,
#ifdef CONFIG_BASE_ADC_HALL_SENSOR
    .width = ADC_WIDTH_BIT_12,
#else
    .width = ADC_WIDTH_BIT_DEFAULT,
#endif
};

static adc_channel_t gpio2adc(gpio_num_t pin) {
    LOOPN(j, SOC_ADC_MAX_CHANNEL_NUM) {
        if (adc_channel_io_map[0][j] == pin) return j;
    }
    return ADC_CHANNEL_MAX;
}

static void adc_initialize() {
    char buf[16];
    if (parse_u8(Config.sys.ADC_MULT, &adc.nsample)) adc.nsample = 5;
    LOOPN(i, LEN(adc.chans)) {
        if (adc.pins[i] == GPIO_NUM_NC) continue;
        if (( adc.chans[i] = gpio2adc(adc.pins[i]) ) == ADC_CHANNEL_MAX) {
            ESP_LOGE(TAG, "ADC: invalid pin %d", adc.pins[i]);
            return;
        }
        snprintf(buf, sizeof(buf), "ADC%d", adc.chans[i]);
        gpio_usage(adc.pins[i], strdup(buf));
    }
    esp_err_t err = ESP_OK;
#ifdef IDF_TARGET_V5
    adc_oneshot_unit_init_cfg_t init_conf = { .unit_id = adc.unit };
    if (!( err = adc_oneshot_new_unit(&init_conf, &adc.oneshot) )) {
        adc_oneshot_chan_cfg_t chan_conf = {
            .bitwidth = adc.width,
            .atten = adc.atten,
        };
        ITERV(chan, adc.chans) {
            if (chan == ADC_CHANNEL_MAX) continue;
            err = adc_oneshot_config_channel(adc.oneshot, chan, &chan_conf);
            if (err) break;
        }
    }
    if (!err) err = adc_calibration_init(adc.unit, adc.atten, &adc.cali);
#else
    ITERV(chan, adc.chans) {
        if (chan == ADC_CHANNEL_MAX) continue;
        if (( err = adc1_config_channel_atten(chan, adc.atten) )) break;
    }
    if (!err) err = adc1_config_width(adc.width);
#   ifdef CONFIG_IDF_TARGET_ESP32
    if (esp_adc_cal_check_efuse(ESP_ADC_CAL_VAL_EFUSE_VREF)) {
        ESP_LOGI(TAG, "ADC: eFuse VRef not supported");
    } else {
        ESP_LOGD(TAG, "ADC: eFuse VRef supported");
    }
#   endif
#   if defined(CONFIG_IDF_TARGET_ESP32) || defined(CONIFG_IDF_TARGET_ESP32S3)
    if (esp_adc_cal_check_efuse(ESP_ADC_CAL_VAL_EFUSE_TP)) {
        ESP_LOGI(TAG, "ADC: eFuse Two Point not supported");
    } else {
        ESP_LOGD(TAG, "ADC: eFuse Two Point supported");
    }
#   endif
    memset(&adc.chars, 0, sizeof(adc.chars));
    esp_adc_cal_value_t vtype = esp_adc_cal_characterize(
        adc.unit, adc.atten, adc.width, 1100, &adc.chars);
    if (vtype == ESP_ADC_CAL_VAL_EFUSE_TP) {
        ESP_LOGD(TAG, "ADC: characterized using Two Point Value");
    } else if (vtype == ESP_ADC_CAL_VAL_EFUSE_VREF) {
        ESP_LOGD(TAG, "ADC: characterized using eFuse VRef");
    } else {
        ESP_LOGD(TAG, "ADC: characterized using Default VRef");
    }
#endif // IDF_TARGET_V5
    if (err) {
        ESP_LOGE(TAG, "ADC initialize failed: %s", esp_err_to_name(err));
        LOOPN(i, LEN(adc.chans)) { adc.chans[i] = ADC_CHANNEL_MAX; }
    }
}

int adc_hall() {
#if defined(CONFIG_BASE_ADC_HALL_SENSOR) && defined(IDF_TARGET_V4)
    int raw = 0;
    adc_power_acquire();
    LOOPN(i, adc.nsample) {
        usleep(10);
        raw += hall_sensor_read();
    }
    adc_power_release();
    ITERV(chan, adc.chans) {
        if (chan != ADC_CHANNEL_MAX) adc1_config_channel_atten(chan, adc.atten);
    }
    return raw / adc.nsample;
#else
    return 0;
#endif
}

int adc_read(uint8_t idx) {
    if (idx >= LEN(adc.chans) || adc.chans[idx] == ADC_CHANNEL_MAX)
        return -1;
    int raw, cum = 0, cnt = 0;
    LOOPN(i, adc.nsample) {
        usleep(10);
#ifdef IDF_TARGET_V5
        adc_oneshot_read(adc.oneshot, adc.chans[idx], &raw);
#else
        raw = adc1_get_raw(adc.chans[idx]);
#endif
        if (raw == -1) return -1;
        cum += raw;
        cnt++;
    }
#ifdef IDF_TARGET_V5
    if (cnt) adc_cali_raw_to_voltage(adc.oneshot, cum / cnt, &raw);
    return cnt ? raw : -1;
#else
    return cnt ? esp_adc_cal_raw_to_voltage(cum / cnt, &adc.chars) : -1;
#endif
}

int adc_joystick(int *dx, int *dy) {
#ifdef CONFIG_BASE_ADC_JOYSTICK
    static int px, py;
    int x = adc_read(0);
    int y = adc_read(1);
    if (x == -1 || y == -1) return -1;
    if (dx) *dx = x - px ?: x;
    if (dy) *dy = y - py ?: y;
    px = x; py = y;
    return x << 16 | y;
#else
    return -1; NOTUSED(dx); NOTUSED(dy);
#endif
}

#else // CONFIG_BASE_USE_ADC
int adc_hall() { return 0; }
int adc_read(uint8_t i) { return -1; NOTUSED(i); }
int adc_joystick(int *x, int *y) { return -1; NOTUSED(x); NOTUSED(y); }
#endif // CONFIG_BASE_USE_ADC

