hankso/esp32/espbase/main/drivers.c
/******************************************************************************
 * DAC analog out
 */

#ifdef CONFIG_BASE_USE_DAC
#   include "soc/dac_periph.h"
#   include "driver/dac.h"

static dac_channel_t dac_chan = DAC_CHANNEL_MAX;

static dac_channel_t gpio2dac(gpio_num_t pin) {
    LOOPN(i, SOC_DAC_PERIPH_NUM) {
        if (dac_periph_signal.dac_channel_io_num[i] == pin) return i;
    }
    return DAC_CHANNEL_MAX;
}

static void dac_initialize() {
    if (( dac_chan = gpio2dac(PIN_DAC) ) == DAC_CHANNEL_MAX) {
        ESP_LOGE(TAG, "DAC: invalid pin %d", PIN_DAC);
        return;
    }
    dac_output_enable(dac_chan);
}

esp_err_t dac_write(uint8_t val) {
    if (dac_chan == DAC_CHANNEL_MAX) return ESP_ERR_INVALID_STATE;
    dac_cw_generator_disable();
    return dac_output_voltage(dac_chan, val);
}

esp_err_t dac_cwave(uint32_t val) {
    if (dac_chan == DAC_CHANNEL_MAX) return ESP_ERR_INVALID_STATE;
    dac_cw_config_t conf = {
        .en_ch = dac_chan,
        .scale = MIN((val >> 8) & 0xFF, DAC_CW_SCALE_8),
        .freq = CONS(val >> 16, 130, 55000),
        .offset = (val & 0xFF) - 128, // -128 ~ 127
    };
    dac_cw_generator_enable();
    return dac_cw_generator_config(&conf);
}
#else
esp_err_t dac_write(uint8_t v) { return ESP_ERR_NOT_SUPPORTED; NOTUSED(v); }
esp_err_t dac_cwave(uint32_t v) { return ESP_ERR_NOT_SUPPORTED; NOTUSED(v); }
#endif

/******************************************************************************
 * PWM by hardware LEDC
 */

// LEDC_TIMER_0 and LEDC_CHANNEL_0 is for LED

#define SPEED_MODE  LEDC_LOW_SPEED_MODE

#define BUZZER_TMR  LEDC_TIMER_1
#define BUZZER_RES  LEDC_TIMER_10_BIT
#define BUZZER_CH   LEDC_CHANNEL_1

#define SERVO_TMR   LEDC_TIMER_2
#define SERVO_RES   LEDC_TIMER_10_BIT
#define SERVO_CHH   LEDC_CHANNEL_2
#define SERVO_CHV   LEDC_CHANNEL_3

// LEDC_TIMER_3 and LEDC_CHANNEL_4 is for Camera XCLK

static void pwm_initialize() {
#ifdef CONFIG_BASE_USE_SERVO
    ledc_timer_config_t servo_conf = {
        .speed_mode         = SPEED_MODE,
        .timer_num          = SERVO_TMR,
        .duty_resolution    = SERVO_RES,
        .freq_hz            = 50, // 20ms
        .clk_cfg            = LEDC_AUTO_CLK
    };
    ESP_ERROR_CHECK( ledc_timer_config(&servo_conf) );
    ledc_channel_config_t hor_conf = {
        .gpio_num           = PIN_SVOH,
        .speed_mode         = servo_conf.speed_mode,
        .channel            = SERVO_CHH,
        .timer_sel          = servo_conf.timer_num,
        .hpoint             = 0,
        .duty               = 0
    };
    ledc_channel_config_t ver_conf = {
        .gpio_num           = PIN_SVOV,
        .speed_mode         = servo_conf.speed_mode,
        .channel            = SERVO_CHV,
        .timer_sel          = servo_conf.timer_num,
        .hpoint             = 0,
        .duty               = 0
    };
    ESP_ERROR_CHECK( ledc_channel_config(&hor_conf) );
    ESP_ERROR_CHECK( ledc_channel_config(&ver_conf) );
#endif
#ifdef CONFIG_BASE_USE_BUZZER
    ledc_timer_config_t buzzer_conf = {
        .speed_mode         = SPEED_MODE,
        .timer_num          = BUZZER_TMR,
        .duty_resolution    = BUZZER_RES,
        .freq_hz            = 5000, // 0-5kHz is commonlly used
        .clk_cfg            = LEDC_AUTO_CLK
    };
    ESP_ERROR_CHECK( ledc_timer_config(&buzzer_conf) );
    ledc_channel_config_t chan_conf = {
        .gpio_num           = PIN_BUZZ,
        .speed_mode         = buzzer_conf.speed_mode,
        .channel            = BUZZER_CH,
        .timer_sel          = buzzer_conf.timer_num,
        .hpoint             = 0,
        .duty               = 0
    };
    ESP_ERROR_CHECK( ledc_channel_config(&chan_conf) );
#endif
}

static UNUSED esp_err_t pwm_set_duty(int channel, int duty) {
    esp_err_t err = ledc_set_duty(SPEED_MODE, channel, duty);
    if (!err) err = ledc_update_duty(SPEED_MODE, channel);
    return err;
}

#ifdef CONFIG_BASE_USE_SERVO
// mapping 0-180 deg to 0.5-2.5 ms
static const float servo_offset = 0.5 / 20 * ((1 << SERVO_RES) - 1);
static const float servo_scale  = 2.0 / 20 * ((1 << SERVO_RES) - 1) / 180;

esp_err_t pwm_set_degree(int hdeg, int vdeg) {
    esp_err_t err = ESP_OK;
    if (!err && hdeg >= 0) {
        hdeg = MIN(180, 166 * hdeg / 180 + 14);
        err = pwm_set_duty(SERVO_CHH, hdeg * servo_scale + servo_offset);
    }
    if (!err && vdeg >= 0) {
        vdeg = MIN(160, vdeg);
        err = pwm_set_duty(SERVO_CHV, vdeg * servo_scale + servo_offset);
    }
    return err;
}

esp_err_t pwm_get_degree(int *hdeg, int *vdeg) {
    int hduty = ledc_get_duty(SPEED_MODE, SERVO_CHH),
        vduty = ledc_get_duty(SPEED_MODE, SERVO_CHV);
    *hdeg = (int)((hduty - servo_offset) / servo_scale);
    *vdeg = (int)((vduty - servo_offset) / servo_scale);
    return ESP_OK;
}
#else
esp_err_t pwm_set_degree(int h, int v) {
    return ESP_ERR_NOT_SUPPORTED; NOTUSED(h); NOTUSED(v);
}
esp_err_t pwm_get_degree(int *h, int *v) {
    return ESP_ERR_NOT_SUPPORTED; NOTUSED(h); NOTUSED(v);
}
#endif

#ifdef CONFIG_BASE_USE_BUZZER
// mapping 0-100 percent to 0%-50% of duty
static const float buzzer_scale = ((1 << BUZZER_RES) - 1) / 200;

esp_err_t pwm_set_tone(int freq, int pcnt) {
    esp_err_t err = freq > 20000 ? ESP_ERR_INVALID_ARG : ESP_OK;
    if (freq == 0) pcnt = 0;
    if (!err && freq > 0)  err = ledc_set_freq(SPEED_MODE, BUZZER_TMR, freq);
    if (!err && pcnt >= 0) err = pwm_set_duty(BUZZER_CH, pcnt * buzzer_scale);
    return err;
}

esp_err_t pwm_get_tone(int *freq, int *pcnt) {
    *freq = ledc_get_freq(SPEED_MODE, BUZZER_TMR);
    *pcnt = (int)(ledc_get_duty(SPEED_MODE, BUZZER_CH) / buzzer_scale);
    return ESP_OK;
}
#else
esp_err_t pwm_set_tone(int f, int p) {
    return ESP_ERR_NOT_SUPPORTED; NOTUSED(f); NOTUSED(p);
}
esp_err_t pwm_get_tone(int *f, int *p) {
    return ESP_ERR_NOT_SUPPORTED; NOTUSED(f); NOTUSED(p);
}
#endif

#undef SPEED_MODE
#undef SERVO_TMR
#undef SERVO_RES
#undef SERVO_CHH
#undef SERVO_CHV
#undef BUZZER_TMR
#undef BUZZER_RES
#undef BUZZER_CH

