hankso/esp32/espbase/main/drivers.c
/******************************************************************************
 * GPIO Interrupt (inc. button & knob)
 */

static const char * usage_table[GPIO_PIN_COUNT] = {
#if defined(CONFIG_IDF_TARGET_ESP32)
    [0]         = "Strapping PU",
    [2]         = "Strapping PD",
    [5]         = "Strapping PU",
    [6]         = "Flash SPICLK",
    [7]         = "Flash SPIQ (PICO-D4)",
    [8]         = "Flash SPID (PICO-D4)",
    [9]         = "Flash SPIHD (PICO-V3-02)",
    [10]        = "Flash SPIWP (PICO-V3-02)",
    [11]        = "Flash SPICS0",
    [16]        = "Flash D2WD",
    [17]        = "Flash D2WD",
    [20]        = "ESP32-PICO-V3",
#elif defined(CONFIG_IDF_TARGET_ESP32S3)
    [0]         = "Strapping PU",
    [3]         = "Strapping Float",
    [19]        = "USB DN",
    [20]        = "USB DP",
    [26]        = "Flash SPICS1",
    [27]        = "Flash SPIHD",
    [28]        = "Flash SPIWP",
    [29]        = "Flash SPICS0",
    [30]        = "Flash SPICLK",
    [31]        = "Flash SPIQ",
    [32]        = "Flash SPID",
    [45]        = "Strapping PD",
    [46]        = "Strapping PD",
#endif
#ifdef CONFIG_BASE_USE_LED
    [PIN_LED]   = "LED",
#endif
#ifdef CONFIG_BASE_USE_UART
    [PIN_TXD]   = "UART TX" STR(CONFIG_BASE_UART_NUM),
    [PIN_RXD]   = "UART RX" STR(CONFIG_BASE_UART_NUM),
#endif
#ifdef CONFIG_BASE_USE_I2S
    [PIN_CLK]   = "I2S CLK",
    [PIN_DAT]   = "I2S DAT",
#endif
#ifdef CONFIG_BASE_USE_I2C0
    [PIN_SDA0]  = "I2C SDA0",
    [PIN_SCL0]  = "I2C SCL0",
#endif
#ifdef CONFIG_BASE_USE_I2C1
    [PIN_SDA1]  = "I2C SDA1",
    [PIN_SCL1]  = "I2C SCL1",
#endif
#ifdef CONFIG_BASE_USE_SPI
    [PIN_MISO]  = "SPI MISO",
    [PIN_MOSI]  = "SPI MOSI",
    [PIN_SCLK]  = "SPI SCLK",
#endif
#ifdef CONFIG_BASE_SDFS_SPI
    [PIN_CS0]   = "SPI CS0 (SDCard)",
#endif
#ifdef CONFIG_BASE_SCN_SPI
    [PIN_CS1]   = "SPI CS1 (Screen)",
#endif
#ifdef CONFIG_BASE_GEXP_SPI
    [PIN_CS2]   = "SPI CS2 (GPIOExp)",
#endif
#ifdef CONFIG_BASE_GPIO_INT
    [PIN_INT]   = "Interrupt",
#endif
#if defined(CONFIG_BASE_ADC_HALL_SENSOR)
    [PIN_ADC0]  = "HALL Sensor P",
    [PIN_ADC1]  = "HALL Sensor N",
#elif defined(CONFIG_BASE_ADC_JOYSTICK)
    [PIN_ADC0]  = "Joystick X",
    [PIN_ADC1]  = "Joystick Y",
#endif
#ifdef CONFIG_BASE_USE_DAC
    [PIN_DAC]   = "DAC",
#endif
#ifdef CONFIG_BASE_USE_TPAD
    [PIN_TPAD]  = "Touch",
#endif
#ifdef CONFIG_BASE_BTN_INPUT
    [PIN_BTN]   = "Button",
#endif
#ifdef CONFIG_BASE_USE_KNOB
    [PIN_ENCA]  = "Knob Encoder A",
    [PIN_ENCB]  = "Knob Encoder B",
#endif
#ifdef CONFIG_BASE_USE_SERVO
    [PIN_SVOH]  = "Servo Yaw",
    [PIN_SVOV]  = "Servo Pitch",
#endif
#ifdef CONFIG_BASE_USE_BUZZER
    [PIN_BUZZ]  = "Buzzer",
#endif
};

const char * gpio_usage(gpio_num_t pin, const char *usage) {
    if (pin < 0 || pin >= GPIO_PIN_COUNT) return NULL;
    const char *current = usage_table[pin];
    if (!strlen(usage ?: "") || (current && !startswith(current, "Strapping")))
        return current;
    return usage_table[pin] = usage;
}

#ifdef CONFIG_BASE_USE_BTN
static UNUSED button_handle_t btn[2];

static UNUSED void cb_button(void *arg, void *data) {
    static const char *BTAG = "button";
    int pin = (int)data, val = (iot_button_get_event(arg) << 8) | pin;
    scn_command(SCN_BTN, &val);
    switch (val >> 8) {
    case BUTTON_PRESS_DOWN:
        ESP_LOGD(BTAG, "%d press", pin);
#   if defined(CONFIG_BASE_BTN_INPUT) && !defined(CONFIG_BASE_BOARD_S3NL191)
        if (pin == PIN_BTN) hid_report_sdial(HID_TARGET_ALL, SDIAL_D);
#   endif
        break;
    case BUTTON_PRESS_UP:
        ESP_LOGD(BTAG, "%d release[%d]", pin, iot_button_get_ticks_time(arg));
#   if defined(CONFIG_BASE_BTN_INPUT) && !defined(CONFIG_BASE_BOARD_S3NL191)
        if (pin == PIN_BTN) hid_report_sdial(HID_TARGET_ALL, SDIAL_U);
#   endif
        break;
    case BUTTON_SINGLE_CLICK:
        ESP_LOGD(BTAG, "%d single click", pin);
        break;
    case BUTTON_DOUBLE_CLICK:
        ESP_LOGD(BTAG, "%d double click", pin);
        break;
    case BUTTON_MULTIPLE_CLICK:
        ESP_LOGD(BTAG, "%d click %d times", pin, iot_button_get_repeat(arg));
        break;
    case BUTTON_LONG_PRESS_HOLD:
        ESP_LOGD(BTAG, "%d long press %d",
                 pin, iot_button_get_long_press_hold_cnt(arg));
        break;
    default: break;
    }
}

static UNUSED button_handle_t button_init(
    button_config_t *conf, gpio_num_t pin, button_cb_t cb
) {
    button_handle_t hdl = iot_button_create(conf);
    if (!hdl) {
        ESP_LOGE(TAG, "bind to GPIO%d failed", pin);
    } else LOOPN(event, BUTTON_EVENT_MAX) {
        if (event == BUTTON_MULTIPLE_CLICK) {
            button_event_config_t evt = {
                .event = event,
                .event_data.multiple_clicks.clicks = 3,
            };
            iot_button_register_event_cb(hdl, evt, cb, (void *)pin);
        } else {
            iot_button_register_cb(hdl, event, cb, (void *)pin);
        }
    }
    return hdl;
}

#   ifdef CONFIG_BASE_ADC_JOYSTICK
static button_handle_t jstk[4];

static void cb_joystick(void *arg, void *data) {
    button_event_t event = iot_button_get_event(arg);
    if (event != BUTTON_PRESS_DOWN && event != BUTTON_LONG_PRESS_HOLD) return;
    int x = adc_read(0), y = adc_read(1);
    if (x == -1 || y == -1) return;
    x = x > 1900 ? (x - 1900) : x < 1400 ? (x - 1400) : 0;
    y = y > 1900 ? (y - 1900) : y < 1400 ? (y - 1400) : 0;
    if (x && y) hid_report_mouse_move(HID_TARGET_ALL, x / 28, y / 28); // ±50
}
#   endif

#   ifdef CONFIG_BASE_USE_KNOB
static knob_handle_t knob;
static const char *KTAG = "knob";

static void cb_knob(void *arg, void *data) {
    switch (iot_knob_get_event(arg)) {
    case KNOB_LEFT:
        ESP_LOGD(KTAG, "left rotate %d", iot_knob_get_count_value(arg));
        hid_report_sdial(HID_TARGET_ALL, SDIAL_L);
        break;
    case KNOB_RIGHT:
        ESP_LOGD(KTAG, "right rotate %d", iot_knob_get_count_value(arg));
        hid_report_sdial(HID_TARGET_ALL, SDIAL_R);
        break;
    default: break;
    }
}
#   endif
#endif // CONFIG_BASE_USE_BTN

static void gpio_initialize() {
#ifdef CONFIG_BASE_USE_BTN
#   ifdef CONFIG_BASE_BTN_INPUT
    button_config_t btn_conf = {
        .type = BUTTON_TYPE_GPIO,
        .gpio_button_config = {
            .gpio_num = PIN_BTN,
            .active_level = strbool(Config.sys.BTN_HIGH),
        }
    };
    btn[0] = button_init(&btn_conf, PIN_BTN, cb_button);
#   endif
#   ifdef CONFIG_BASE_BTN_GPIO0
    const char *usage = gpio_usage(GPIO_NUM_0, NULL);
    if (!usage || startswith(usage, "Strapping")) {
        button_config_t io0_conf = {
            .type = BUTTON_TYPE_GPIO,
            .gpio_button_config = { .gpio_num = GPIO_NUM_0 },
        };
        btn[1] = button_init(&io0_conf, GPIO_NUM_0, cb_button);
        if (btn[1] && !usage) {
            gpio_usage(GPIO_NUM_0, "Button");
        } else if (btn[1]) {
            static char desc[32];
            snprintf(desc, sizeof(desc), "%s (Button)", usage);
            gpio_usage(GPIO_NUM_0, desc);
        }
    }
#   endif
#   ifdef CONFIG_BASE_ADC_JOYSTICK
    button_config_t adc_conf = {
        .type = BUTTON_TYPE_ADC,
        .long_press_time = CONFIG_BUTTON_SHORT_PRESS_TIME_MS + 20,
#       ifdef IDF_TARGET_V5
        .adc_button_config = { .adc_handle = adc.oneshot },
#       endif
    };
    LOOPN(i, LEN(adc.chans)) {
        if (adc.chans[i] == ADC_CHANNEL_MAX) continue;
        adc_conf.adc_button_config.adc_channel = adc.chans[i];
        adc_conf.adc_button_config.button_index = 0;
        adc_conf.adc_button_config.min = 0;
        adc_conf.adc_button_config.max = 1400; // 0.0-1.4V
        jstk[2 * i + 0] = button_init(&adc_conf, adc.pins[i], cb_joystick);
        adc_conf.adc_button_config.button_index = 1;
        adc_conf.adc_button_config.min = 1900;
        adc_conf.adc_button_config.max = 3300; // 1.9-3.3V
        jstk[2 * i + 1] = button_init(&adc_conf, adc.pins[i], cb_joystick);
    }
#   endif
#   ifdef CONFIG_BASE_USE_KNOB
    knob_event_t events[] = { KNOB_LEFT, KNOB_RIGHT };
    knob_config_t knob_conf = {
        .default_direction = 0,     // 0:positive; 1:negative
        .gpio_encoder_a = PIN_ENCA,
        .gpio_encoder_b = PIN_ENCB
    };
    if (!( knob = iot_knob_create(&knob_conf) )) {
        ESP_LOGE(KTAG, "bind to GPIO%d & %d failed", PIN_ENCA, PIN_ENCB);
    } else ITERV(event, events) {
        iot_knob_register_cb(knob, event, cb_knob, NULL);
    }
#   endif
#endif
}

esp_err_t gexp_set_level(int pin, bool level) {
    if (GPIO_IS_VALID_GPIO(pin)) {
#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(5, 5, 0)
        // TODO: gpio_get_io_config();
#endif
        esp_err_t err = gpio_set_direction(pin, GPIO_MODE_INPUT_OUTPUT);
        return err ?: gpio_set_level(pin, level);
    }
#ifdef CONFIG_BASE_GEXP_I2C
    if (PIN_IS_I2CEXP(pin))      return i2c_gexp_set_level(pin, level);
#endif
#ifdef CONFIG_BASE_GEXP_SPI
    if (PIN_IS_SPIEXP(pin))      return spi_gexp_set_level(pin, level);
#endif
    return ESP_ERR_INVALID_ARG;
}

esp_err_t gexp_get_level(int pin, bool *level, bool sync) {
    if (GPIO_IS_VALID_GPIO(pin)) {
        *level = gpio_get_level(pin);
        return ESP_OK;
    }
#ifdef CONFIG_BASE_GEXP_I2C
    if (PIN_IS_I2CEXP(pin)) return i2c_gexp_get_level(pin, level, sync);
#endif
#ifdef CONFIG_BASE_GEXP_SPI
    if (PIN_IS_SPIEXP(pin)) return spi_gexp_get_level(pin, level, sync);
#endif
    return ESP_ERR_INVALID_ARG;
}

void gpio_table(bool i2c, bool spi) {
    const char *value;
    printf("Native GPIO %d-%d\nPIN Value Usage\n", 0, GPIO_PIN_COUNT - 1);
    LOOPN(pin, GPIO_PIN_COUNT) {
        if (!GPIO_IS_VALID_GPIO(pin)) continue;
        value = gpio_get_level(pin) ? "HIGH" : "LOW";
        printf("%-3d %5s %s\n", pin, value, gpio_usage(pin, NULL) ?: "");
    }
#ifdef CONFIG_BASE_GEXP_I2C
    if (i2c) {
        printf("\nI2C GPIOExp %d-%d\nPIN Value\n",
               PIN_I2C_BASE, PIN_I2C_MAX - 1);
        bool level;
        esp_err_t err;
        LOOP(pin, PIN_I2C_BASE, PIN_I2C_MAX) {
            if (!( err = i2c_gexp_get_level(pin, &level, false) )) {
                value = level ? "HIGH" : "LOW";
            } else if (err == ESP_ERR_NOT_FOUND) {
                value = "";
            } else {
                value = esp_err_to_name(err);
            }
            printf("%-3d %5s\n", pin, value);
        }
    }
#endif
#ifdef CONFIG_BASE_GEXP_SPI
    if (spi) {
        printf("\nSPI GPIOExp %d-%d\nPIN Value\n",
               PIN_SPI_BASE, PIN_SPI_MAX - 1);
        bool level;
        esp_err_t err;
        LOOP(pin, PIN_SPI_BASE, PIN_SPI_MAX) {
            if (!( err = spi_gexp_get_level(pin, &level, false) )) {
                value = level ? "HIGH" : "LOW";
            } else if (err == ESP_ERR_INVALID_STATE) {
                value = "";
            } else {
                value = esp_err_to_name(err);
            }
            printf("%-3d %5s\n", pin, value);
        }
    }
#endif
}

/******************************************************************************
 * Task Watchdog
 */

static void twdt_initialize() {
#if defined(CONFIG_ESP_TASK_WDT_CHECK_IDLE_TASK_CPU0) \
 || defined(CONFIG_ESP_TASK_WDT_CHECK_IDLE_TASK_CPU1)
    // Idle tasks are created on each core automatically by RTOS scheduler
    // with the lowest possible priority (0). Our tasks have higher priority,
    // thus leaving almost no time for idle tasks to run. Disable WDT on them.
#   ifdef CONFIG_FREERTOS_UNICORE
    LOOPN(i, 1)
#   else
    LOOPN(i, 2)
#   endif
    {
        TaskHandle_t idle = xTaskGetIdleTaskHandleForCPU(i);
        if (idle && !esp_task_wdt_status(idle) && !esp_task_wdt_delete(idle)) {
            ESP_LOGI(TAG, "Task IDLE%d @ CPU%d removed from WDT", i, i);
        }
    }
#endif // CONFIG_ESP_TASK_WDT_CHECK_IDLE_TASK_CPUx
}

void driver_initialize() {
    const char * tags[] = {
        "gpio", "led_indicator", "adc button", "knob", "cam_hal", "camera",
    };
    ITERV(tag, tags) { esp_log_level_set(tag, ESP_LOG_WARN); }

    uart_initialize();
    twdt_initialize();
    pwm_initialize();
#ifdef CONFIG_BASE_USE_ADC
    adc_initialize();
#endif
#ifdef CONFIG_BASE_USE_DAC
    dac_initialize();
#endif
#ifdef CONFIG_BASE_USE_SPI
    spi_initialize();
#endif
#ifdef CONFIG_BASE_USE_I2C
    i2c_initialize();
#endif
    gpio_initialize();
#ifdef CONFIG_BASE_USE_LED
    led_initialize();
#endif
    avc_initialize();
    scn_initialize();
    gexp_initialize();
}
